In [2]:
## Reading Data From Different Sources

import pandas as pd
from io import StringIO

Data = '{"employee_name": "John Doe", "age": 30, "department": "HR", "email": "john.doe@example.com", "job_profile": [{"title1": "Manager", "title2": "Team Lead"}]}'

df = pd.read_json(StringIO(Data))

In [3]:
df

,employee_name,age,department,email,job_profile
0,John Doe,30,HR,john.doe@example.com,"{'title1': 'Manager', 'title2': 'Team Lead'}"

In [ ]:
# Convert the DataFrame to a JSON string using the default orientation ("columns")
df.to_json()

'{"employee_name":{"0":"John Doe"},"age":{"0":30},"department":{"0":"HR"},"email":{"0":"john.doe@example.com"},"job_profile":{"0":{"title1":"Manager","title2":"Team Lead"}}}'

In [ ]:
# Convert the DataFrame to a JSON string where the index labels are the keys
df.to_json(orient='index')

'{"0":{"employee_name":"John Doe","age":30,"department":"HR","email":"john.doe@example.com","job_profile":{"title1":"Manager","title2":"Team Lead"}}}'

In [ ]:
# Convert the DataFrame to a JSON string where each row is a separate JSON object in a list
df.to_json(orient='records')

'[{"employee_name":"John Doe","age":30,"department":"HR","email":"john.doe@example.com","job_profile":{"title1":"Manager","title2":"Team Lead"}}]'

In [7]:
df= pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/wine/wine.data", header=None)

In [8]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
1,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
2,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185
3,1,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480
4,1,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735

In [10]:
df.to_csv("wine.csv")

In [14]:
!pip install lxml

Requirement already satisfied: lxml in c:\users\iamem\.conda\envs\ml_env\lib\site-packages (6.0.0)

In [24]:
url = "https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)"
df = pd.read_html(url)

In [30]:
df[2]

    Country/Territory IMF[1][12]            World Bank[13]             \
    Country/Territory   Forecast       Year       Estimate       Year
0               World  113795678       2025      111326370       2024
1       United States   30507217       2025       29184890       2024
2               China   19231705  [n 1]2025       18743803  [n 3]2024
3             Germany    4744804       2025        4659929       2024
4               India    4187017       2025        3912686       2024
..                ...        ...        ...            ...        ...
217          Kiribati        312       2025            308       2024
218  Marshall Islands        297       2025            280       2024
219             Nauru        169       2025            160       2024
220        Montserrat          —          —              —          —
221            Tuvalu         65       2025             62       2023

    United Nations[14]
              Estimate       Year
0            100834796       2022
1             27720700       2023
2             17794782  [n 1]2023
3              4525704       2023
4              3575778       2023
..                 ...        ...
217                289       2023
218                270       2023
219                176       2023
220                 80       2023
221                 68       2023

[222 rows x 7 columns]

In [33]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\iamem\.conda\envs\ml_env\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\iamem\.conda\envs\ml_env\lib\site-packages (from openpyxl) (2.0.0)

In [36]:
df_excel = pd.read_excel("data.xlsx")

In [37]:
df_excel

      Name  Age
0     Emir   22
1  Emirhan   30
2     Mete   40

In [40]:
# A pickle file is a binary file used to serialize Python objects (like DataFrames) into a byte stream, 
# allowing them to be saved to disk and later deserialized (unpickled) to restore the original object.

df_excel.to_pickle('data')

In [41]:
pd.read_pickle('data')

      Name  Age
0     Emir   22
1  Emirhan   30
2     Mete   40